results_shopcart-sim-jvm/run_1_2026-01-05_03-32-11/FIXED-800-latency-1-dump.txt
Running 30s test @ http://127.0.0.1:8001
  16 threads and 16 connections
  Thread calibration: mean lat.: 3.079ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.732ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.663ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.569ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.267ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.602ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.456ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.763ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.508ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.411ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.406ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.480ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.200ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.642ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.487ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.386ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.18ms  384.55us   5.83ms   67.64%
    Req/Sec    53.23     52.76   111.00     75.76%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.19ms
 75.000%    1.45ms
 90.000%    1.67ms
 99.000%    2.00ms
 99.900%    2.60ms
 99.990%    5.20ms
 99.999%    5.83ms
100.000%    5.83ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.171     0.000000            1         1.00
       0.690     0.100000         1603         1.11
       0.847     0.200000         3204         1.25
       0.970     0.300000         4805         1.43
       1.083     0.400000         6408         1.67
       1.189     0.500000         8006         2.00
       1.240     0.550000         8797         2.22
       1.291     0.600000         9608         2.50
       1.342     0.650000        10395         2.86
       1.396     0.700000        11196         3.33
       1.453     0.750000        11997         4.00
       1.482     0.775000        12393         4.44
       1.513     0.800000        12793         5.00
       1.547     0.825000        13191         5.71
       1.580     0.850000        13591         6.67
       1.619     0.875000        13986         8.00
       1.643     0.887500        14189         8.89
       1.666     0.900000        14386        10.00
       1.691     0.912500        14590        11.43
       1.722     0.925000        14787        13.33
       1.749     0.937500        14988        16.00
       1.765     0.943750        15086        17.78
       1.785     0.950000        15185        20.00
       1.805     0.956250        15285        22.86
       1.829     0.962500        15389        26.67
       1.857     0.968750        15486        32.00
       1.872     0.971875        15540        35.56
       1.886     0.975000        15585        40.00
       1.905     0.978125        15638        45.71
       1.920     0.981250        15685        53.33
       1.942     0.984375        15735        64.00
       1.954     0.985938        15760        71.11
       1.967     0.987500        15786        80.00
       1.981     0.989062        15811        91.43
       2.004     0.990625        15835       106.67
       2.029     0.992188        15861       128.00
       2.043     0.992969        15872       142.22
       2.065     0.993750        15885       160.00
       2.079     0.994531        15897       182.86
       2.099     0.995313        15910       213.33
       2.111     0.996094        15924       256.00
       2.119     0.996484        15928       284.44
       2.139     0.996875        15935       320.00
       2.161     0.997266        15941       365.71
       2.195     0.997656        15947       426.67
       2.227     0.998047        15953       512.00
       2.231     0.998242        15956       568.89
       2.259     0.998437        15960       640.00
       2.281     0.998633        15963       731.43
       2.379     0.998828        15966       853.33
       2.737     0.999023        15969      1024.00
       2.771     0.999121        15970      1137.78
       2.965     0.999219        15972      1280.00
       3.595     0.999316        15974      1462.86
       4.055     0.999414        15975      1706.67
       4.383     0.999512        15977      2048.00
       4.383     0.999561        15977      2275.56
       4.727     0.999609        15978      2560.00
       4.791     0.999658        15979      2925.71
       4.963     0.999707        15980      3413.33
       5.067     0.999756        15981      4096.00
       5.067     0.999780        15981      4551.11
       5.067     0.999805        15981      5120.00
       5.199     0.999829        15982      5851.43
       5.199     0.999854        15982      6826.67
       5.763     0.999878        15983      8192.00
       5.763     0.999890        15983      9102.22
       5.763     0.999902        15983     10240.00
       5.763     0.999915        15983     11702.86
       5.763     0.999927        15983     13653.33
       5.831     0.999939        15984     16384.00
       5.831     1.000000        15984          inf
#[Mean    =        1.184, StdDeviation   =        0.385]
#[Max     =        5.828, Total count    =        15984]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  24016 requests in 30.00s, 7.17MB read
Requests/sec:    800.49
Transfer/sec:    244.80KB